       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBL0002.
       AUTHOR. Walter Miguel Abitte Junior.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DATA-SISTEMA.
          05 WS-ANO-SIS     PIC 9(04).
          05 WS-MES-SIS     PIC 9(02).
          05 WS-DIA-SIS     PIC 9(02).

       01 WS-DATA-FORMATADA.
          05 WS-DIA-EUR     PIC 9(02).
          05 FILLER         PIC X VALUE '/'.
          05 WS-MES-EUR     PIC 9(02).
          05 FILLER         PIC X VALUE '/'.
          05 WS-ANO-EUR     PIC 9(04).

       PROCEDURE DIVISION.

           PERFORM 001-OBTER-DATA-SISTEMA.
           PERFORM 002-MONTA-DATA-FORMATO-EUROPEU.
           PERFORM 003-EMITIR-MENSAGEM.
           PERFORM 004-FINALIZAR.

       001-OBTER-DATA-SISTEMA.
      * OBTER DATA DO SISTEMA OPERACIONAL NO FORMATO YYYYMMDD
           ACCEPT WS-DATA-SISTEMA FROM DATE YYYYMMDD.

       001-OBTER-DATA-SISTEMA-FIM.

       002-MONTA-DATA-FORMATO-EUROPEU.
      * MONTA DATA FORMATO EUROPEU
       
           MOVE WS-ANO-SIS     TO WS-ANO-EUR.
           MOVE WS-MES-SIS     TO WS-MES-EUR.
           MOVE WS-DIA-SIS     TO WS-DIA-EUR.

       002-MONTA-DATA-FORMATO-EUROPEU-FIM. 

       003-EMITIR-MENSAGEM.

           DISPLAY 'Data em formato EUROPEAN: ' WS-DATA-FORMATADA.

       003-EMITIR-MENSAGEM-FIM.

       004-FINALIZAR.
       
           STOP RUN.   

       004-FINALIZAR-FIM.    